Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ1024EFH124.atdf
      <value-group caption="ADC Filter Mode bit" name="ADCFLTR4__DFMODE">
         <value caption="Filter x works in Averaging mode" name="" value="0x1"/>
         <value caption="Filter x works in Oversampling Filter mode (default)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter Significant Data Length bit" name="ADCFLTR4__DATA16EN">
         <value caption="All 16 bits of the filter output data are significant" name="" value="0x1"/>
         <value caption="Only the first 12 bits are significant" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Filter x Enable bit" name="ADCFLTR4__AFEN">
         <value caption="Digital filter is enabled" name="" value="0x1"/>
         <value caption="Digital filter is disabled and the AFRDY status bit is cleared" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Filter Analog Input Selection bits" name="ADCFLTR5__CHNLID">
         <value caption="Reserved" name="" value="0x1f"/>
         <value caption="Reserved" name="" value="0xc"/>
         <value caption="AN11" name="" value="0xb"/>
         <value caption="AN2" name="" value="0x2"/>
         <value caption="AN1" name="" value="0x1"/>
         <value caption="AN0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Filter x Data Ready Status bit" name="ADCFLTR5__AFRDY">
         <value caption="Data is ready in the FLTRDATA bits" name="" value="0x1"/>
         <value caption="Data is not ready" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Filter x Interrupt Enable bit" name="ADCFLTR5__AFGIEN">
         <value caption="Digital filter interrupt is enabled and is generated by the AFRDY status bit" name="" value="0x1"/>
         <value caption="Digital filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Oversampling Filter Ratio bits" name="ADCFLTR5__OVRSAM">
         <value caption="(If DFMODE is 0) 128 samples (shift sum 3 bits to right" name="" value="0x7"/>
         <value caption="(If DFMODE is 0) 32 samples (shift sum 2 bits to right" name="" value="0x6"/>
         <value caption="(If DFMODE is 0) 8 samples (shift sum 1 bit to right" name="" value="0x5"/>
         <value caption="(If DFMODE is 0) 2 samples (shift sum 0 bits to right" name="" value="0x4"/>
         <value caption="(If DFMODE is 0) 256 samples (shift sum 4 bits to right" name="" value="0x3"/>
         <value caption="(If DFMODE is 0) 64 samples (shift sum 3 bits to right" name="" value="0x2"/>
         <value caption="(If DFMODE is 0) 16 samples (shift sum 2 bits to right" name="" value="0x1"/>
         <value caption="(If DFMODE is 0) 4 samples (shift sum 1 bit to right" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Filter Mode bit" name="ADCFLTR5__DFMODE">
         <value caption="Filter x works in Averaging mode" name="" value="0x1"/>
         <value caption="Filter x works in Oversampling Filter mode (default)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter Significant Data Length bit" name="ADCFLTR5__DATA16EN">
         <value caption="All 16 bits of the filter output data are significant" name="" value="0x1"/>
         <value caption="Only the first 12 bits are significant" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Filter x Enable bit" name="ADCFLTR5__AFEN">
         <value caption="Digital filter is enabled" name="" value="0x1"/>
         <value caption="Digital filter is disabled and the AFRDY status bit is cleared" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Filter Analog Input Selection bits" name="ADCFLTR6__CHNLID">
         <value caption="Reserved" name="" value="0x1f"/>
         <value caption="Reserved" name="" value="0xc"/>
         <value caption="AN11" name="" value="0xb"/>
         <value caption="AN2" name="" value="0x2"/>
         <value caption="AN1" name="" value="0x1"/>
         <value caption="AN0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Filter x Data Ready Status bit" name="ADCFLTR6__AFRDY">
         <value caption="Data is ready in the FLTRDATA bits" name="" value="0x1"/>
         <value caption="Data is not ready" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Filter x Interrupt Enable bit" name="ADCFLTR6__AFGIEN">
         <value caption="Digital filter interrupt is enabled and is generated by the AFRDY status bit" name="" value="0x1"/>
         <value caption="Digital filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Oversampling Filter Ratio bits" name="ADCFLTR6__OVRSAM">
         <value caption="(If DFMODE is 0) 128 samples (shift sum 3 bits to right" name="" value="0x7"/>
         <value caption="(If DFMODE is 0) 32 samples (shift sum 2 bits to right" name="" value="0x6"/>
         <value caption="(If DFMODE is 0) 8 samples (shift sum 1 bit to right" name="" value="0x5"/>
         <value caption="(If DFMODE is 0) 2 samples (shift sum 0 bits to right" name="" value="0x4"/>
         <value caption="(If DFMODE is 0) 256 samples (shift sum 4 bits to right" name="" value="0x3"/>
         <value caption="(If DFMODE is 0) 64 samples (shift sum 3 bits to right" name="" value="0x2"/>
         <value caption="(If DFMODE is 0) 16 samples (shift sum 2 bits to right" name="" value="0x1"/>
         <value caption="(If DFMODE is 0) 4 samples (shift sum 1 bit to right" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Filter Mode bit" name="ADCFLTR6__DFMODE">
         <value caption="Filter x works in Averaging mode" name="" value="0x1"/>
         <value caption="Filter x works in Oversampling Filter mode (default)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter Significant Data Length bit" name="ADCFLTR6__DATA16EN">
         <value caption="All 16 bits of the filter output data are significant" name="" value="0x1"/>
         <value caption="Only the first 12 bits are significant" name="" value="0x0"/>
      </value-group>
      <value-group caption="Digital Filter x Enable bit" name="ADCFLTR6__AFEN">
         <value caption="Digital filter is enabled" name="" value="0x1"/>
         <value caption="Digital filter is disabled and the AFRDY status bit is cleared" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Source for Conversion of Analog Input AN0 Select bits" name="ADCTRG1__TRGSRC0">
         <value caption="Reserved" name="" value="0x1f"/>
         <value caption="Reserved" name="" value="0xd"/>
         <value caption="Comparator 2 (COUT)" name="" value="0xc"/>
         <value caption="Comparator 1 (COUT)" name="" value="0xb"/>
         <value caption="OCMP5" name="" value="0xa"/>
         <value caption="OCMP3" name="" value="0x9"/>
         <value caption="OCMP1" name="" value="0x8"/>
         <value caption="TMR5 match" name="" value="0x7"/>
         <value caption="TMR3 match" name="" value="0x6"/>
         <value caption="TMR1 match" name="" value="0x5"/>
         <value caption="INT0 External interrupt" name="" value="0x4"/>
         <value caption="STRIG" name="" value="0x3"/>
         <value caption="Global level software trigger (GLSWTRG)" name="" value="0x2"/>
         <value caption="Global software edge Trigger (GSWTRG)" name="" value="0x1"/>
         <value caption="No Trigger" name="" value="0x0"/>
      </value-group>
