Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ1024EFH124.atdf
         <register caption="" name="PMD4" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x00000001" name="T1MD"/>
            <bitfield mask="0x00000002" name="T2MD"/>
            <bitfield mask="0x00000004" name="T3MD"/>
            <bitfield mask="0x00000008" name="T4MD"/>
            <bitfield mask="0x00000010" name="T5MD"/>
            <bitfield mask="0x00000020" name="T6MD"/>
            <bitfield mask="0x00000040" name="T7MD"/>
            <bitfield mask="0x00000080" name="T8MD"/>
            <bitfield mask="0x00000100" name="T9MD"/>
         </register>
         <register caption="" name="PMD5" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x00000001" name="U1MD"/>
            <bitfield mask="0x00000002" name="U2MD"/>
            <bitfield mask="0x00000004" name="U3MD"/>
            <bitfield mask="0x00000008" name="U4MD"/>
            <bitfield mask="0x00000010" name="U5MD"/>
            <bitfield mask="0x00000020" name="U6MD"/>
            <bitfield mask="0x00000100" name="SPI1MD"/>
            <bitfield mask="0x00000200" name="SPI2MD"/>
            <bitfield mask="0x00000400" name="SPI3MD"/>
            <bitfield mask="0x00000800" name="SPI4MD"/>
            <bitfield mask="0x00001000" name="SPI5MD"/>
            <bitfield mask="0x00002000" name="SPI6MD"/>
            <bitfield mask="0x00010000" name="I2C1MD"/>
            <bitfield mask="0x00020000" name="I2C2MD"/>
            <bitfield mask="0x00040000" name="I2C3MD"/>
            <bitfield mask="0x00080000" name="I2C4MD"/>
            <bitfield mask="0x00100000" name="I2C5MD"/>
            <bitfield mask="0x01000000" name="USBMD"/>
            <bitfield mask="0x10000000" name="CAN1MD"/>
            <bitfield mask="0x20000000" name="CAN2MD"/>
         </register>
         <register caption="" name="PMD6" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x00000001" name="RTCCMD"/>
            <bitfield mask="0x00000100" name="REFO1MD"/>
            <bitfield mask="0x00000200" name="REFO2MD"/>
            <bitfield mask="0x00000400" name="REFO3MD"/>
            <bitfield mask="0x00000800" name="REFO4MD"/>
            <bitfield mask="0x00010000" name="PMPMD"/>
            <bitfield mask="0x00020000" name="EBIMD"/>
            <bitfield mask="0x00800000" name="SQI1MD"/>
            <bitfield mask="0x10000000" name="ETHMD"/>
         </register>
         <register caption="" name="PMD7" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x00000010" name="DMAMD"/>
            <bitfield mask="0x00100000" name="RNGMD"/>
            <bitfield mask="0x00400000" name="CRYPTMD"/>
         </register>
         <register caption="External Bus Interface Address Pin Configuration Register" name="CFGEBIA" offset="0xc0" rw="RW" size="4">
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00000001" name="EBIA0EN" values="CFGEBIA__EBIA0EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00000002" name="EBIA1EN" values="CFGEBIA__EBIA1EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00000004" name="EBIA2EN" values="CFGEBIA__EBIA2EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00000008" name="EBIA3EN" values="CFGEBIA__EBIA3EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00000010" name="EBIA4EN" values="CFGEBIA__EBIA4EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00000020" name="EBIA5EN" values="CFGEBIA__EBIA5EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00000040" name="EBIA6EN" values="CFGEBIA__EBIA6EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00000080" name="EBIA7EN" values="CFGEBIA__EBIA7EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00000100" name="EBIA8EN" values="CFGEBIA__EBIA8EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00000200" name="EBIA9EN" values="CFGEBIA__EBIA9EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00000400" name="EBIA10EN" values="CFGEBIA__EBIA10EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00000800" name="EBIA11EN" values="CFGEBIA__EBIA11EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00001000" name="EBIA12EN" values="CFGEBIA__EBIA12EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00002000" name="EBIA13EN" values="CFGEBIA__EBIA13EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00004000" name="EBIA14EN" values="CFGEBIA__EBIA14EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00008000" name="EBIA15EN" values="CFGEBIA__EBIA15EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00010000" name="EBIA16EN" values="CFGEBIA__EBIA16EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00020000" name="EBIA17EN" values="CFGEBIA__EBIA17EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00040000" name="EBIA18EN" values="CFGEBIA__EBIA18EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00080000" name="EBIA19EN" values="CFGEBIA__EBIA19EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00100000" name="EBIA20EN" values="CFGEBIA__EBIA20EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00200000" name="EBIA21EN" values="CFGEBIA__EBIA21EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00400000" name="EBIA22EN" values="CFGEBIA__EBIA22EN"/>
            <bitfield caption="EBI Address Pin Enable bits" mask="0x00800000" name="EBIA23EN" values="CFGEBIA__EBIA23EN"/>
            <bitfield caption="EBI Pin Enable bit" mask="0x80000000" name="EBIPINEN" values="CFGEBIA__EBIPINEN"/>
         </register>
         <register caption="External Bus Interface Control Pin Configuration Register" name="CFGEBIC" offset="0xd0" rw="RW" size="4">
            <bitfield caption="EBI Data Lower Byte Pin Enable bit" mask="0x00000001" name="EBIDEN0" values="CFGEBIC__EBIDEN0"/>
            <bitfield caption="EBI Data Upper Byte Pin Enable bit" mask="0x00000002" name="EBIDEN1" values="CFGEBIC__EBIDEN1"/>
            <bitfield caption="/EBICS0 Pin Enable bit" mask="0x00000010" name="EBICSEN0" values="CFGEBIC__EBICSEN0"/>
            <bitfield caption="/EBICS1 Pin Enable bit" mask="0x00000020" name="EBICSEN1" values="CFGEBIC__EBICSEN1"/>
            <bitfield caption="/EBICS2 Pin Enable bit" mask="0x00000040" name="EBICSEN2" values="CFGEBIC__EBICSEN2"/>
            <bitfield caption="/EBICS3 Pin Enable bit" mask="0x00000080" name="EBICSEN3" values="CFGEBIC__EBICSEN3"/>
            <bitfield caption="/EBIBS0 Pin Enable bit" mask="0x00000100" name="EBIBSEN0" values="CFGEBIC__EBIBSEN0"/>
            <bitfield caption="/EBIBS1 Pin Enable bit" mask="0x00000200" name="EBIBSEN1" values="CFGEBIC__EBIBSEN1"/>
            <bitfield caption="/EBIOE Pin Enable bit" mask="0x00001000" name="EBIOEEN" values="CFGEBIC__EBIOEEN"/>
            <bitfield caption="/EBIWE Pin Enable bit" mask="0x00002000" name="EBIWEEN" values="CFGEBIC__EBIWEEN"/>
            <bitfield caption="/EBIRP Pin Sensitivity Control bit" mask="0x00010000" name="EBIRPEN" values="CFGEBIC__EBIRPEN"/>
            <bitfield caption="EBIRDYx Pin Sensitivity Control bit" mask="0x00020000" name="EBIRDYLVL" values="CFGEBIC__EBIRDYLVL"/>
            <bitfield caption="EBIRDY1 Pin Enable bit" mask="0x02000000" name="EBIRDYEN1" values="CFGEBIC__EBIRDYEN1"/>
            <bitfield caption="EBIRDY2 Pin Enable bit" mask="0x04000000" name="EBIRDYEN2" values="CFGEBIC__EBIRDYEN2"/>
            <bitfield caption="EBIRDY3 Pin Enable bit" mask="0x08000000" name="EBIRDYEN3" values="CFGEBIC__EBIRDYEN3"/>
            <bitfield caption="EBIRDY1 Inversion Control bit" mask="0x20000000" name="EBIRDYINV1" values="CFGEBIC__EBIRDYINV1"/>
            <bitfield caption="EBIRDY2 Inversion Control bit" mask="0x40000000" name="EBIRDYINV2" values="CFGEBIC__EBIRDYINV2"/>
            <bitfield caption="EBIRDY3 Inversion Control bit" mask="0x80000000" name="EBIRDYINV3" values="CFGEBIC__EBIRDYINV3"/>
         </register>
         <register caption="Permission Group Configuration Register" name="CFGPG" offset="0xe0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CPUPG"/>
            <bitfield mask="0x00000030" name="DMAPG"/>
            <bitfield mask="0x00000300" name="USBPG"/>
            <bitfield mask="0x00003000" name="CAN1PG"/>
            <bitfield mask="0x0000C000" name="CAN2PG"/>
            <bitfield mask="0x00030000" name="ETHPG"/>
            <bitfield mask="0x00300000" name="SQI1PG"/>
            <bitfield mask="0x00C00000" name="FCPG"/>
            <bitfield caption="Crypto Engine Permission Group bits" mask="0x03000000" name="CRYPTPG" values="CFGPG__CRYPTPG"/>
            <bitfield mask="0xC0000000" name="ICD1PG"/>
         </register>
      </register-group>
      <value-group caption="Silicon Revision" name="DEVID__VER">
         <value caption="Revision A1" name="" value="0x10000000"/>
         <value caption="Revision A3" name="" value="0x30000000"/>
         <value caption="Revision B2" name="" value="0x60000000"/>
      </value-group>
      <value-group caption="TDO Enable for 2-Wire JTAG" name="CFGCON__TDOEN">
         <value caption="2-wire JTAG protocol uses TDO" name="" value="0x1"/>
         <value caption="2-wire JTAG protocol does not use TDO" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trace Output Enable bit" name="CFGCON__TROEN">
         <value caption="Enable trace outputs and start trace clock (trace probe must be present)" name="" value="0x1"/>
         <value caption="Disable trace outputs and stop trace clock" name="" value="0x0"/>
      </value-group>
      <value-group caption="JTAG Port Enable bit" name="CFGCON__JTAGEN">
         <value caption="Enable the JTAG port" name="" value="0x1"/>
         <value caption="Disable the JTAG port" name="" value="0x0"/>
      </value-group>
      <value-group caption="Flash ECC Configuration bits" name="CFGCON__ECCCON">
         <value caption="ECC and dynamic ECC are disabled (ECCCON bits are writable)" name="" value="0x3"/>
         <value caption="ECC and dynamic ECC are disabled (ECCCON bits are locked)" name="" value="0x2"/>
         <value caption="Dynamic Flash ECC is enabled (ECCCON bits are locked)" name="" value="0x1"/>
         <value caption="Flash ECC is enabled (ECCCON bits are locked; disables word Flash writes)" name="" value="0x0"/>
      </value-group>
      <value-group caption="USB Suspend Sleep Enable bit(1)" name="CFGCON__USBSSEN">
         <value caption="USB PHY clock is shut down when Sleep mode is active" name="" value="0x1"/>
         <value caption="USB PHY clock continues to run when Sleep is active" name="" value="0x0"/>
      </value-group>
