Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.29/atdf/PIC32MZ1024EFH124.atdf
         <register caption="System Bus Target 'x' Single Error Clear Register" name="SBT13ECLRS" offset="0xaf20" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR"/>
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT0ECLRM" offset="0x7b28" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR"/>
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT1ECLRM" offset="0x7f28" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR"/>
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT2ECLRM" offset="0x8328" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR"/>
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT3ECLRM" offset="0x8728" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR"/>
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT4ECLRM" offset="0x8b28" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR"/>
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT5ECLRM" offset="0x8f28" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR"/>
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT6ECLRM" offset="0x9328" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR"/>
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT7ECLRM" offset="0x9728" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR"/>
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT8ECLRM" offset="0x9b28" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR"/>
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT9ECLRM" offset="0x9f28" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR"/>
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT10ECLRM" offset="0xa328" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR"/>
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT11ECLRM" offset="0xa728" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR"/>
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT12ECLRM" offset="0xab28" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR"/>
         </register>
         <register caption="System Bus Target 'x' Multiple Error Clear Register" name="SBT13ECLRM" offset="0xaf28" rw="R" size="4">
            <bitfield mask="0x00000001" name="CLEAR"/>
         </register>
         <register caption="" name="SBT0REG0" offset="0x7b30" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT0REG0__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT0REG0__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT0REG1" offset="0x7b50" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT0REG1__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT0REG1__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT1REG0" offset="0x7f30" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT1REG0__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT1REG0__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT1REG2" offset="0x7f70" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT1REG2__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT1REG2__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT1REG3" offset="0x7f90" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT1REG3__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT1REG3__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT1REG4" offset="0x7fb0" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT1REG4__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT1REG4__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT1REG5" offset="0x7fd0" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT1REG5__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT1REG5__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT1REG6" offset="0x7ff0" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT1REG6__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT1REG6__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT1REG7" offset="0x8010" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT1REG7__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT1REG7__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT1REG8" offset="0x8030" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT1REG8__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT1REG8__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT2REG0" offset="0x8330" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT2REG0__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT2REG0__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT2REG1" offset="0x8350" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT2REG1__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT2REG1__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT2REG2" offset="0x8370" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT2REG2__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT2REG2__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT3REG0" offset="0x8730" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT3REG0__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT3REG0__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT3REG1" offset="0x8750" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT3REG1__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT3REG1__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT3REG2" offset="0x8770" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT3REG2__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT3REG2__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT4REG0" offset="0x8b30" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT4REG0__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT4REG0__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
         <register caption="" name="SBT4REG2" offset="0x8b70" rw="RW" size="4">
            <bitfield caption="Region Size bits" mask="0x000000F8" name="SIZE" values="SBT4REG2__SIZE"/>
            <bitfield caption="Region Priority Level bit" mask="0x00000200" name="PRI" values="SBT4REG2__PRI"/>
            <bitfield mask="0xFFFFFC00" name="BASE"/>
         </register>
